In [2]:
import pandas as pd

```bash
pip install sqlalchemy psycopg2-binary 
```

In [3]:
from sqlalchemy import create_engine

In [4]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [5]:
engine.connect()

In [7]:
query = """
SELECT 1 as number;
"""

pd.read_sql(query, con=engine)

   number
0       1

In [8]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_tripdata_trip,root,None,False,False,False,False
1,public,green_taxi_data,root,None,True,False,False,False
2,public,yellow_taxi_data,root,None,True,False,False,False
3,public,zones,root,None,True,False,False,False

In [10]:
query = """
select 
    count(*) 
from green_taxi_data 
where 1=1
    and cast(lpep_pickup_datetime as date) = date '2019-01-15' 
    and cast(lpep_dropoff_datetime as date) = date '2019-01-15'
"""

pd.read_sql(query, con=engine)

   count
0  20530

In [11]:
query = """
select 
    cast(lpep_pickup_datetime as date), 
    trip_distance
from green_taxi_data  
order by 2 desc
"""

pd.read_sql(query, con=engine)

       lpep_pickup_datetime  trip_distance
0                2019-01-15         117.99
1                2019-01-18          80.96
2                2019-01-28          64.27
3                2019-01-10          64.20
4                2019-01-06          60.91
...                     ...            ...
630913           2019-01-01           0.00
630914           2019-01-01           0.00
630915           2019-01-01           0.00
630916           2019-01-01           0.00
630917           2019-01-01           0.00

[630918 rows x 2 columns]

In [14]:
query = """
select 
    count(*), 
    passenger_count 
from green_taxi_data 
where 1=1
    and (passenger_count = 2 or passenger_count = 3) 
    and cast(lpep_pickup_datetime as date) = date '2019-01-01' 
group by 2  
"""

pd.read_sql(query, con=engine)

   count  passenger_count
0   1282                2
1    254                3

In [7]:
df = pd.read_csv('yellow_tripdata_2021-01.csv', nrows=100)

In [15]:
query = """
select 
    z2."Zone", 
    max(g.tip_amount) 
from green_taxi_data as g 
left join zones as z on g."PULocationID" = z."LocationID" 
left join zones as z2 on g."DOLocationID"= z2."LocationID" 
where z."Zone" = 'Astoria' 
group by 1 
order by 2 desc 
limit 1
"""

pd.read_sql(query, con=engine)

                            Zone   max
0  Long Island City/Queens Plaza  88.0